package day02;

/*
  关于java语言中的标识符
    1.什么是标识符？
      - 在java源程序当中凡是程序员有权利自己命名的单词都是标识符。
      - 标识符可以标识什么元素？
        类名
        方法名
        变量名
        常量名
        接口名
    2.标识符的命名规则？【不按照这个规则来，编译器会报错，这是语法】
      一个合法的标识符必须由数字、字母、下划线（_）、美元符号（$）组成，不能含有其他符号
      不能数字开头
      严格区分大小写
      关键字不能作为标识符
      理论上无长度限制
    3.标识符的命名规范？【只是一种规范，不属于语法，不遵守规范，编译器不会报错】
      最好见名知义
      遵守驼峰命名方式
      例如：
        SystemService
        UserService
      类名、接口名：大写，以后每个单词首字母大写
      变量名、方法名：首字母小写，后面每个单词首字母大写
      常量名：全部大写
*/

public class IdentifierTest01 {
  public static void main(String[] args) {

  }
}
